Project is currently very limited in term of computing the value of Stacks. If existing_secrets_manager_crn is set, then any resource that would be created as part of the sm instance creation (key protect key) should be skipped.

 2024/04/29 11:31:02 [34mStarting command: terraform1.5 plan -input=false -refresh=true -state=terraform.tfstate -var-file=schematics.tfvars -no-color -out=tfplan.binary[39m[0m
 2024/04/29 11:31:02 Starting command: terraform1.5 plan -input=false -refresh=true -state=terraform.tfstate -var-file=schematics.tfvars -no-color -out=tfplan.binary
 2024/04/29 11:31:15 Terraform plan | 
 2024/04/29 11:31:15 Terraform plan | Terraform used the selected providers to generate the following execution
 2024/04/29 11:31:15 Terraform plan | plan. Resource actions are indicated with the following symbols:
 2024/04/29 11:31:15 Terraform plan |   + create
 2024/04/29 11:31:15 Terraform plan | 
 2024/04/29 11:31:15 Terraform plan | Terraform planned the following actions, but then encountered a problem:
 2024/04/29 11:31:15 Terraform plan | 
 2024/04/29 11:31:15 Terraform plan |   # module.resource_group.ibm_resource_group.resource_group[0] will be created
 2024/04/29 11:31:15 Terraform plan |   + resource "ibm_resource_group" "resource_group" {
 2024/04/29 11:31:15 Terraform plan |       + created_at          = (known after apply)
 2024/04/29 11:31:15 Terraform plan |       + crn                 = (known after apply)
 2024/04/29 11:31:15 Terraform plan |       + default             = (known after apply)
 2024/04/29 11:31:15 Terraform plan |       + id                  = (known after apply)
 2024/04/29 11:31:15 Terraform plan |       + name                = "0429-0429-stack-service-rg"
 2024/04/29 11:31:15 Terraform plan |       + payment_methods_url = (known after apply)
 2024/04/29 11:31:15 Terraform plan |       + quota_id            = (known after apply)
 2024/04/29 11:31:15 Terraform plan |       + quota_url           = (known after apply)
 2024/04/29 11:31:15 Terraform plan |       + resource_linkages   = (known after apply)
 2024/04/29 11:31:15 Terraform plan |       + state               = (known after apply)
 2024/04/29 11:31:15 Terraform plan |       + teams_url           = (known after apply)
 2024/04/29 11:31:15 Terraform plan |       + updated_at          = (known after apply)
 2024/04/29 11:31:15 Terraform plan |     }
 2024/04/29 11:31:15 Terraform plan | 
 2024/04/29 11:31:15 Terraform plan | Plan: 1 to add, 0 to change, 0 to destroy.
 2024/04/29 11:31:15 Terraform plan | 
 2024/04/29 11:31:15 Terraform plan | Changes to Outputs:
 2024/04/29 11:31:15 Terraform plan |   + resource_group_id      = (known after apply)
 2024/04/29 11:31:15 Terraform plan |   + resource_group_name    = "0429-0429-stack-service-rg"
 2024/04/29 11:31:15 Terraform plan |   + secrets_manager_region = "eu-de"
 2024/04/29 11:31:15 Terraform plan | 
 2024/04/29 11:31:15 Terraform plan | Error: Missing required argument
 2024/04/29 11:31:15 Terraform plan | 
 2024/04/29 11:31:15 Terraform plan |   with module.kms[0].module.kms_key_rings["0429-sm-cos-key-ring"].ibm_kms_key_rings.key_ring,
 2024/04/29 11:31:15 Terraform plan |   on .terraform/modules/kms.kms_key_rings/main.tf line 7, in resource "ibm_kms_key_rings" "key_ring":
 2024/04/29 11:31:15 Terraform plan |    7:   instance_id   = var.instance_id
 2024/04/29 11:31:15 Terraform plan | 
 2024/04/29 11:31:15 Terraform plan | The argument "instance_id" is required, but no definition was found.
 2024/04/29 11:31:15 Terraform plan | 
 2024/04/29 11:31:15 Terraform plan | Error: Error in function call
 2024/04/29 11:31:15 Terraform plan | 
 2024/04/29 11:31:15 Terraform plan |   on .terraform/modules/kms/main.tf line 22, in locals:
 2024/04/29 11:31:15 Terraform plan |   22:   existing_instance_validate_check = regex("^${local.existing_instance_validate_msg}$", (!local.existing_instance_validate_condition ? local.existing_instance_validate_msg : ""))
 2024/04/29 11:31:15 Terraform plan |     ├────────────────
 2024/04/29 11:31:15 Terraform plan |     │ while calling regex(pattern, string)
 2024/04/29 11:31:15 Terraform plan |     │ local.existing_instance_validate_condition is true
 2024/04/29 11:31:15 Terraform plan |     │ local.existing_instance_validate_msg is "A value must be provided for 'existing_key_protect_instance_guid' when 'create_key_protect_instance' is false"
 2024/04/29 11:31:15 Terraform plan | 
 2024/04/29 11:31:15 Terraform plan | Call to function "regex" failed: pattern did not match any part of the given
 2024/04/29 11:31:15 Terraform plan | string.
 2024/04/29 11:31:15 [1m[31mTerraform PLAN error: Terraform PLAN errorexit status 1[39m[0m
 